## Data Frame

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

In [9]:
df1 = pd.DataFrame({"Ad":["İstanbul", "Ankara", "İzmir", "Bursa", "Antalya"], 
                   "Nüfus":[150229231, 5445026, 4279677, 2936803, 2364396],
                   "Kod":["34", "06", "35", "16", "07"]
                  })
df1
# Kolonlar(Değişkenler/Variables)
# Satırlar(Gözlemler/Observations)

         Ad      Nüfus Kod
0  İstanbul  150229231  34
1    Ankara    5445026  06
2     İzmir    4279677  35
3     Bursa    2936803  16
4   Antalya    2364396  07

In [15]:
dizi1 = np.array([[0,1,2,3],[4,5,6,7]])
df2 = pd.DataFrame(dizi1)
df2

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [18]:
df2.columns = ["Column 1", "Column 2", "Column 3", "Column 4"]
df2.index = ["Row 1", "Row 2"]
# veya   df2.pd.DataFrame(dizi1, columns=["Column 1", ....], index=["Row 1", ....])
df2

       Column 1  Column 2  Column 3  Column 4
Row 1         0         1         2         3
Row 2         4         5         6         7

In [20]:
# boş veri çerçevesi oluşturup sonradan da ekleyebiliriz.
df3 = pd.DataFrame()
df3["Column 1"] = [9,8,7,6]
df3["Column 2"] = [5,4,3,2]
df3.index = ["Row 1", "Row 2", "Row 3", "Row 4"]
df3

       Column 1  Column 2
Row 1         9         5
Row 2         8         4
Row 3         7         3
Row 4         6         2

**Bu kısmı anlamadım:<br>**
"Pep8 ile ilgili küçük bir not: Muhtemelen iki yanında boşluk olan ” = “ i değer atama için, “==” i ise karşılaştırma için kullanıyorsunuz. Python'da, okunabilirliği geliştirmek ve argumanlar atamalarını değişken atamalarından ayırt etmeyi kolaylaştırmak için “=” in iki yanında boşluk kullanılmaması alışkanlığı yerleşmiştir."

In [25]:
ulke_kod = ['FR', 'GE', 'US', 'UK', 'CN']
ulkeler = pd.DataFrame(index=ulke_kod)
ulkeler.index.name = "Kod"
ulkeler

Empty DataFrame
Columns: []
Index: [FR, GE, US, UK, CN]

In [38]:
ulkeler["Ülke"] = ['Fransa', 'Almanya', 'ABD', 'İngiltere', 'Çin']
ulkeler["Nüfus"] = [61083916, 82400996, 301139947, 60776238, 1318683096]
ulkeler["Yaşam Süresi"] = [80.657, 79.406, 78.242 ,79.425, 72.961]
ulkeler["Toplam Gelir"] = [2657213249384, 3439953462907, 14477635000000, 3074359743897, 3552182311652]
ulkeler["Kıta"] = ['Avrupa', 'Avrupa', 'Amerika', 'Avrupa', 'Asya']
## "Ort. Yaşam Süresi" ismini değiştirdim fakat yeni bir sütun olarak geldi. Silemedim.
## del ulkeler["Ort. Yaşam Süresi"] yazınca oldu. Bu doğru bir yöntem mi? Arkasında bir data falan bıraktı mı? .drop
ulkeler["Yıl"] = 2007
ulkeler

          Ülke       Nüfus    Toplam Gelir     Kıta  Yaşam Süresi   Yıl
Kod
FR      Fransa    61083916   2657213249384   Avrupa        80.657  2007
GE     Almanya    82400996   3439953462907   Avrupa        79.406  2007
US         ABD   301139947  14477635000000  Amerika        78.242  2007
UK   İngiltere    60776238   3074359743897   Avrupa        79.425  2007
CN         Çin  1318683096   3552182311652     Asya        72.961  2007

In [90]:
print(ulkeler["Nüfus"], "\n")    ## dot notation veya bracket notation. ikisi de olur
print(ulkeler.Nüfus)             ## fakat sütun isminde boşluk varsa, patlar. ["bu daha yaygın kullanılıyor"]
## bu altlardaki Name:  kısmını nasıl kaldırıyoruz?
print("Type is: ", type(ulkeler.Nüfus))

# Bu şekilde tek sutundan oluşan dataframe parçası karşımıza Seri (Series) olarak çıkacak.
# Bu seri aynı zamanda tek boyutlu bir dizidir.

Kod
FR      61083916
GE      82400996
US     301139947
UK      60776238
CN    1318683096
Name: Nüfus, dtype: int64

Kod
FR      61083916
GE      82400996
US     301139947
UK      60776238
CN    1318683096
Name: Nüfus, dtype: int64
Type is:  <class 'pandas.core.series.Series'>

In [99]:
print(ulkeler[["Nüfus"]], "\n")
print("Type is: ", type(ulkeler[["Nüfus"]]))
## series.Series olmasıyla frame.DataFrame olması arasında ne fark var?

          Nüfus
Kod
FR     61083916
GE     82400996
US    301139947
UK     60776238
CN   1318683096

Type is:  <class 'pandas.core.frame.DataFrame'>

In [69]:
ulkeler["Kişi Başı Gelir"] = (ulkeler["Toplam Gelir"] / ulkeler.Nüfus).astype(int)    # işlem yaparak yeni sütun oluşturma
ulkeler

,Ülke,Nüfus,Toplam Gelir,Kıta,Yaşam Süresi,Yıl,Kişi Başı Gelir
Kod,,,,,,,
FR,Fransa,61083916,2657213249384,Avrupa,80.657,2007,43501
GE,Almanya,82400996,3439953462907,Avrupa,79.406,2007,41746
US,ABD,301139947,14477635000000,Amerika,78.242,2007,48076
UK,İngiltere,60776238,3074359743897,Avrupa,79.425,2007,50584
CN,Çin,1318683096,3552182311652,Asya,72.961,2007,2693

## Satır/Sütun Seçme

In [101]:
ulkeler[["Ülke"]]
# Bu tek sütunu seri ya da dizi almak istemiyorsak, yine veri çerçevesinde tutmak istiyorsak iki köşeli parantez kullanmalıyız.

          Ülke
Kod
FR      Fransa
GE     Almanya
US         ABD
UK   İngiltere
CN         Çin

In [95]:
ulkeler["Ülke"]

Kod
FR       Fransa
GE      Almanya
US          ABD
UK    İngiltere
CN          Çin
Name: Ülke, dtype: object

In [105]:
# Şekil olarak baktığımızda çok fark yokmuş gibi görünse de
# sahip oldukları fonksiyonları ve metodları irdelemeye başlayınca farklarını göreceğiz.
# Birden fazla sütun seçeceğimiz zaman ise iki köşeli parantez kesinlikle gerekli.

ulkeler[["Ülke", "Yaşam Süresi"]]

          Ülke  Yaşam Süresi
Kod
FR      Fransa        80.657
GE     Almanya        79.406
US         ABD        78.242
UK   İngiltere        79.425
CN         Çin        72.961

In [110]:
ulkeler[2:4]

,Ülke,Nüfus,Toplam Gelir,Kıta,Yaşam Süresi,Yıl,Kişi Başı Gelir
Kod,,,,,,,
US,ABD,301139947,14477635000000,Amerika,78.242,2007,48076
UK,İngiltere,60776238,3074359743897,Avrupa,79.425,2007,50584

In [114]:
ulkeler.loc[["GE"]]

,Ülke,Nüfus,Toplam Gelir,Kıta,Yaşam Süresi,Yıl,Kişi Başı Gelir
Kod,,,,,,,
GE,Almanya,82400996,3439953462907,Avrupa,79.406,2007,41746

In [115]:
ulkeler.loc["GE"]

Ülke                     Almanya
Nüfus                   82400996
Toplam Gelir       3439953462907
Kıta                      Avrupa
Yaşam Süresi              79.406
Yıl                         2007
Kişi Başı Gelir            41746
Name: GE, dtype: object

In [127]:
ulkeler.loc[[:, "Yaşam Süresi"]]    # DataFrame olmadı

SyntaxError: invalid syntax (<ipython-input-127-c9a231202577>, line 1)

In [124]:
ulkeler.loc[:, "Yaşam Süresi"]

Kod
FR    80.657
GE    79.406
US    78.242
UK    79.425
CN    72.961
Name: Yaşam Süresi, dtype: float64

In [125]:
ulkeler.loc["GE", "Nüfus"]    # almanya'nın nüfusunu seçtik

82400996

In [134]:
ulkeler.iloc[2:4,1:3]

         Nüfus    Toplam Gelir
Kod
US   301139947  14477635000000
UK    60776238   3074359743897

## Koşullu Seçim